{
  "backend/main.mo": "Motoko canister defining core domain types (users, roles, invoices, GST types) with in-memory storage and role-based access control. Implements profile management, invoice models, GST comparison logic, and integrates a shared authorization mixin.",
  "feature_evidence.json": "Structured report enumerating implemented frontend features, their IDs, titles, related files, components, test IDs, and confidence levels. Used to document and trace feature compliance and evidence.",
  "frontend-file-summaries.txt": "Prewritten summaries of major frontend source files, describing React components, hooks, pages, and their responsibilities. Serves as a high-level inventory of frontend architecture and functionality.",
  "frontend/index.css": "Global Tailwind CSS configuration defining design tokens, color variables, light/dark themes, and base styles. Establishes consistent theming across the application.",
  "frontend/index.html": "HTML entry point that sets metadata, favicon, and mounts the React application to the root div. Loads the main TypeScript module.",
  "frontend/README.md": "Frontend overview describing the GST Ledger architecture, authentication, authorization, state management, and styling choices. Explains how the React + TypeScript frontend integrates with the Motoko backend.",
  "frontend/src/App.tsx": "Main application entry configuring TanStack Router routes, role-based guards, and layout composition. Handles authentication state, profile setup flow, and dashboard routing by user role.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Reusable UI screen shown when a user lacks permission to access a route. Displays an error message and provides navigation back to the dashboard.",
  "frontend/src/components/auth/LoginScreen.tsx": "Full-screen login UI that initiates Internet Identity authentication. Shows branding, login status feedback, and a single login action button.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Always-open modal that collects basic user profile details and saves them as a seller profile via a mutation, with validation and toast feedback.",
  "frontend/src/components/auth/RoleGuard.tsx": "Wrapper component that blocks access to children unless the current user’s app role is loaded and included in the allowed roles, otherwise showing a spinner or access denied screen.",
  "frontend/src/components/invoices/BuyerVerificationPanel.tsx": "Panel that lets buyers verify, reject, or request modifications on an invoice using backend mutations, with confirmation dialogs, cache invalidation, and toast notifications.",
  "frontend/src/components/invoices/InvoicePaymentPanel.tsx": "Displays and manages invoice payment status, allowing buyers/admins to initiate payments and sellers/admins to update payment status with amount validation and role-based controls.",
  "frontend/src/components/layout/AppLayout.tsx": "Main application layout with topbar, responsive sidebar navigation, content area, and footer, handling mobile sidebar state.",
  "frontend/src/components/layout/SidebarNav.tsx": "Role-aware sidebar navigation that renders route buttons based on the current user’s app role and highlights the active path.",
  "frontend/src/components/layout/Topbar.tsx": "Top navigation bar showing branding, current user info and role badge, mobile menu toggle, and logout handling with identity and query cache clearing.",
  "frontend/src/config/polling.ts": "Centralized polling interval configuration for different data domains like invoices, inventory, payments, and audit logs.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and caches a backend actor tied to the current identity, initializes access control, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useAuditLogs.ts": "Hook for fetching audit logs with polling support, currently returning an empty list as the backend implementation is pending.",
  "frontend/src/hooks/useCurrentUser.ts": "Hook that loads the current user’s profile and application role using the backend actor and identity, exposing authentication and loading state flags.",
  "frontend/src/hooks/useGstReturns.ts": "Defines React Query mutation hooks for generating GSTR-1 and GSTR-3B returns, but both currently throw errors because backend support is not implemented.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity authentication context and provider using Dfinity AuthClient, managing login state, identity persistence, and login/logout helpers.",
  "frontend/src/hooks/useInventory.ts": "Provides React Query hooks for fetching inventory status and low-stock alerts and for adding/updating inventory items, with placeholder logic pending backend implementation.",
  "frontend/src/hooks/usePayments.ts": "Contains React Query hooks for fetching payment status and initiating or updating payments, currently stubbed out due to missing backend functionality.",
  "frontend/src/hooks/useQueries.ts": "Defines mutation hooks for saving user profiles and assigning application roles by calling backend actor methods and invalidating related queries.",
  "frontend/src/index.css": "Sets up Tailwind CSS layers and defines a custom light/dark theme using CSS variables for colors, borders, charts, and global base styles.",
  "frontend/src/main.tsx": "Bootstraps the React application by rendering the App component wrapped with React Query and Internet Identity providers.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Renders the admin dashboard UI with quick-action buttons for role management, invoices, audit logs, and GST returns navigation.",
  "frontend/src/pages/admin/RoleManagementPage.tsx": "Implements a form-driven admin page for assigning roles to users by Principal ID, collecting profile details and invoking the role assignment mutation.",
  "frontend/src/pages/audit/AuditLogPage.tsx": "Displays and filters audit logs by action type and date range, using selectable filters and a table with contextual action badges.",
  "frontend/src/pages/buyer/BuyerDashboardPage.tsx": "Renders a buyer dashboard with static invoice metrics cards and a quick action button to navigate to the invoices list.",
  "frontend/src/pages/gst/GstReturnsPage.tsx": "Provides UI to generate GSTR-1 and GSTR-3B returns by month/year, fetches data via hooks, and supports downloading results as JSON or CSV with toasts.",
  "frontend/src/pages/inventory/InventoryPage.tsx": "Implements inventory management with listing, adding, and editing items using dialogs, backed by inventory hooks and BigInt quantities.",
  "frontend/src/pages/inventory/LowStockAlertsPage.tsx": "Displays a table of low-stock inventory alerts fetched from hooks, with loading and empty states.",
  "frontend/src/pages/invoices/InvoiceCreateEditPage.tsx": "Form page to create a new invoice, collecting buyer, GST, and line items, then calling the backend actor and invalidating related queries.",
  "frontend/src/pages/invoices/InvoiceDetailPage.tsx": "Shows detailed invoice information with status badge, polling for updates, and embeds buyer verification and payment panels based on fetched invoice data.",
  "frontend/src/pages/invoices/InvoiceListPage.tsx": "React page that fetches and displays a list of invoices using React Query with polling, showing status badges and a table. Allows sellers/admins to create invoices and navigate to invoice detail views.",
  "frontend/src/pages/seller/SellerDashboardPage.tsx": "Seller dashboard UI showing static metric cards and quick action buttons for common tasks like creating invoices and managing inventory. Uses simple navigation without backend data integration.",
  "frontend/src/types/extended.ts": "Defines extended frontend TypeScript types for payments, inventory, GST returns, audit logs, and invoices with verification history, intended for future backend implementation.",
  "frontend/src/utils/download.ts": "Utility functions to download JSON or CSV files in the browser and generate standardized GST return filenames.",
  "frontend/src/utils/gst.ts": "GST helper utilities to format GST types, calculate GST amounts, and produce CGST/SGST or IGST breakdowns based on taxable value.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading URL parameters from query strings or hash routing and persisting them in sessionStorage, with helpers for cleanup and retrieval.",
  "frontend/standalone-gst-demo/index.html": "Standalone HTML entry point for a vanilla GST demo app with login, dashboard, invoice management, and GST return views, designed to run without a build step.",
  "frontend/standalone-gst-demo/script.js": "Vanilla JavaScript SPA logic for the standalone GST demo, handling authentication, navigation, invoice management, GST filing simulation, and fallback API behavior.",
  "frontend/standalone-gst-demo/style.css": "Pure CSS3 stylesheet for a standalone GST demo UI, defining design tokens, base resets, and responsive finance/government-style components (navbar, cards, forms, tables, modals) using Grid and Flexbox.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration enabling dark mode, scanning frontend sources, extending the theme with CSS-variable-driven colors, radii, shadows, and accordion animations, and registering typography, container queries, and animation plugins.",
  "project_state.json": "Project metadata and state file describing the GST system scope, current version, and a catalog of implemented backend and frontend features including auth, dashboards, invoicing, GST returns, and UI infrastructure."
}