{
  "backend/main.mo": "Defines core types and logic for users, invoices, energy readings, and access control with role validation and profile queries.",
  "backend/migration.mo": "Adds migration logic to extend old actor state by introducing an empty energyReadings list.",
  "feature_evidence.json": "Lists feature evidence entries mapping features to their related files, components, tests, and metadata.",
  "frontend-file-summaries.txt": "Contains prewritten summaries describing the purpose of various frontend files across the project.",
  "frontend/index.css": "Defines Tailwind base layers and extensive CSS variables for light and dark themes.",
  "frontend/index.html": "HTML entry point that sets metadata and loads the main React TypeScript application.",
  "frontend/README.md": "Provides frontend architecture overview including authentication, authorization, state management, and styling conventions.",
  "frontend/src/App.tsx": "Main React application file configuring routes, providers, and layout including LiveTelemetry and authentication.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Placeholder file with no content for an access-denied screen component.",
  "frontend/src/components/auth/AuthCornerControl.tsx": "Provides UI controls for login, signup, and user menu using dropdowns and modals based on authentication state.",
  "frontend/src/components/auth/AuthModal.tsx": "Modal with login and signup tabs handling authentication and navigation on success.",
  "frontend/src/components/auth/LoginForm.tsx": "Login form with validation, password toggle, and submit handling with loading state.",
  "frontend/src/components/auth/LoginScreen.tsx": "Empty placeholder component file.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Empty placeholder component file.",
  "frontend/src/components/auth/ProtectedRoute.tsx": "Wrapper that redirects unauthenticated users and renders children only when logged in.",
  "frontend/src/components/auth/RoleGuard.tsx": "Empty placeholder component file.",
  "frontend/src/components/auth/SignUpForm.tsx": "Signup form with input validation and submission logic including loading and error handling.",
  "frontend/src/components/energy/AnimatedNumber.tsx": "Animated number component easing values over time with configurable duration and formatting.",
  "frontend/src/components/energy/charts/ConsumptionByApplianceChart.tsx": "Bar chart visualizing daily and monthly appliance energy consumption.",
  "frontend/src/components/energy/charts/SolarAllocationBarChart.tsx": "Bar chart showing solar, grid, and excess energy allocation values.",
  "frontend/src/components/energy/charts/SolarVsGridPieChart.tsx": "Pie chart comparing solar energy usage versus grid usage.",
  "frontend/src/components/energy/EmptyState.tsx": "Displays an empty state card with message and optional navigation button.",
  "frontend/src/components/energy/ErrorState.tsx": "Error card showing a message with optional retry action.",
  "frontend/src/components/energy/LastUpdatedLabel.tsx": "Shows relative last-updated time and flags stale data based on connection status.",
  "frontend/src/components/energy/LiveStatusBadge.tsx": "Badge indicating live, connecting, or disconnected telemetry status.",
  "frontend/src/components/energy/LoadingState.tsx": "Loading card with spinner and optional message.",
  "frontend/src/components/invoices/BuyerVerificationPanel.tsx": "Empty placeholder component file.",
  "frontend/src/components/invoices/InvoicePaymentPanel.tsx": "Empty placeholder component file.",
  "frontend/src/components/layout/AppLayout.tsx": "Provides the main app layout with topbar, sidebar (desktop and mobile), main content area, and footer.",
  "frontend/src/components/layout/SidebarNav.tsx": "Renders sidebar navigation with route-aware active states and navigation handlers.",
  "frontend/src/components/layout/Topbar.tsx": "Displays the app header with branding, mobile menu toggle, user info, and logout action.",
  "frontend/src/config/polling.ts": "Defines polling configuration for real-time energy data including intervals, backoff, throttling, and logging.",
  "frontend/src/context/AuthContext.tsx": "Manages auth state with token persistence, auto-logout on expiry, and login/logout helpers.",
  "frontend/src/context/LiveTelemetryContext.tsx": "Provides live telemetry state, handling real-time readings, rolling averages, freshness tracking, and connection status.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, refreshing dependent queries on change.",
  "frontend/src/hooks/useAuditLogs.ts": "Empty placeholder hook.",
  "frontend/src/hooks/useAuth.ts": "Convenience hook to access the AuthContext.",
  "frontend/src/hooks/useCurrentUser.ts": "Empty placeholder hook.",
  "frontend/src/hooks/useGstReturns.ts": "Empty placeholder hook.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity auth flow, exposing identity state and login/clear actions.",
  "frontend/src/hooks/useInventory.ts": "Empty placeholder hook.",
  "frontend/src/hooks/useLiveTelemetry.ts": "Convenience hook to access LiveTelemetryContext.",
  "frontend/src/hooks/usePayments.ts": "Empty placeholder hook.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder hook.",
  "frontend/src/index.css": "Tailwind setup with custom green-energy theme variables and base/global styling.",
  "frontend/src/main.tsx": "Initializes React app with QueryClient and InternetIdentityProvider.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Empty admin dashboard page placeholder.",
  "frontend/src/pages/admin/RoleManagementPage.tsx": "Empty role management page placeholder.",
  "frontend/src/pages/audit/AuditLogPage.tsx": "Empty audit log page placeholder.",
  "frontend/src/pages/auth/HomeAuthPage.tsx": "Public landing page displaying hero content, feature highlights, and illustration for the energy optimizer app with an auth control corner.",
  "frontend/src/pages/buyer/BuyerDashboardPage.tsx": "Empty placeholder file for the buyer dashboard page.",
  "frontend/src/pages/energy/ConsumptionPage.tsx": "Fetches and displays consumption analytics with live telemetry updates, including charts, metrics, and error/loading states.",
  "frontend/src/pages/energy/CostEstimationPage.tsx": "Loads and presents cost estimation metrics with real‑time telemetry adjustments and standard loading/error handling.",
  "frontend/src/pages/energy/InputsPage.tsx": "Form for entering appliances and solar system inputs, supporting dynamic fields and submitting data to the energy API.",
  "frontend/src/pages/energy/OverviewPage.tsx": "Dashboard overview showing high‑level energy metrics and prompting users to submit inputs before analysis.",
  "frontend/src/pages/energy/SolarAnalysisPage.tsx": "React page that loads solar analysis data, integrates live telemetry, and displays metrics with charts and status components.",
  "frontend/src/pages/gst/GstReturnsPage.tsx": "Empty placeholder page file for GST returns.",
  "frontend/src/pages/inventory/InventoryPage.tsx": "Empty placeholder page file for inventory management.",
  "frontend/src/pages/inventory/LowStockAlertsPage.tsx": "Empty placeholder page file for low stock alerts.",
  "frontend/src/pages/invoices/InvoiceCreateEditPage.tsx": "Empty placeholder page file for creating or editing invoices.",
  "frontend/src/pages/invoices/InvoiceDetailPage.tsx": "Empty placeholder page file for viewing invoice details.",
  "frontend/src/pages/invoices/InvoiceListPage.tsx": "Empty placeholder page file for listing invoices.",
  "frontend/src/pages/seller/SellerDashboardPage.tsx": "Empty placeholder page file for the seller dashboard.",
  "frontend/src/services/apiClient.ts": "Utility wrapper around fetch providing JSON requests, auth token handling, and basic error propagation.",
  "frontend/src/services/authApi.ts": "Implements login and registration API calls with structured error handling for authentication endpoints.",
  "frontend/src/services/energyApi.ts": "API client for submitting energy inputs and fetching consumption, solar analysis, and cost estimation with validation and auth.",
  "frontend/src/services/energyTypes.ts": "Type definitions and type guards for energy input, consumption, solar analysis, and cost estimation models.",
  "frontend/src/services/liveReadingsApi.ts": "API wrapper around backend actor for real-time energy readings with categorized error handling and logging.",
  "frontend/src/services/realTimeEnergyService.ts": "Polling-based real-time energy service managing subscribers, connection status, throttling, and backoff retries.",
  "frontend/src/state/EnergyFlowContext.tsx": "React context managing submitted energy inputs and exposing setters for input workflow state.",
  "frontend/src/types/extended.ts": "Empty type definition placeholder.",
  "frontend/src/types/liveTelemetry.ts": "Type definitions for live telemetry readings, connection status, rolling averages, and freshness tracking.",
  "frontend/src/utils/download.ts": "Empty download utility placeholder.",
  "frontend/src/utils/gst.ts": "Empty GST utility placeholder.",
  "frontend/src/utils/jwt.ts": "JWT utility functions for decoding tokens, checking expiration, and retrieving expiration time.",
  "frontend/src/utils/realtimeLogging.ts": "Implements a configurable real-time logger with level filtering, context sanitization, and helper methods for connection lifecycle events.",
  "frontend/src/utils/urlParams.ts": "Provides utilities to read, store, retrieve, and clear URL or session-based parameters, including support for hash routing.",
  "frontend/standalone-gst-demo/index.html": "Standalone HTML app defining the GST demo UI structure with login, dashboard, invoice, and GST return views.",
  "frontend/standalone-gst-demo/script.js": "Vanilla JS powering authentication, navigation, invoice management, GST filing, and fallback API behavior for the standalone demo.",
  "frontend/standalone-gst-demo/style.css": "Pure CSS stylesheet providing a responsive finance-themed UI with layout, components, and utility styles for the GST demo.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling custom colors, components, plugins, and design tokens for the frontend build.",
  "project_state.json": "Defines project state and requirements for adding real-time energy data ingestion, processing, storage, and streaming with WebSockets/SSE, plus frontend real-time services and UI updates. Lists architectural notes and existing frontend feature specs."
}