{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Near-real-time live telemetry client, shared state, and UI integration for energy modules",
  "requirements": [
    {
      "id": "REQ-4",
      "summary": "Implement a dedicated real-time telemetry client service with streaming-first and polling fallback, including lifecycle management, reconnect backoff, throttled updates, and recovery.",
      "acceptanceCriteria": [
        "Real-time service attaches the JWT from localStorage(\"auth_token\") to the stream connection (SSE header or WS token mechanism) and to fallback HTTP requests.",
        "If the stream fails to connect or drops, the service transitions to DISCONNECTED and retries with exponential backoff; on recovery it resumes using last-seen timestamp/cursor.",
        "If both stream and live polling fail, the UI continues to function using existing REST fetch flows (e.g., fetchConsumption/fetchSolarAnalysis/fetchCostEstimation) without crashing.",
        "Update emission to UI is throttled/batched so rapid incoming readings do not cause excessive re-renders."
      ],
      "file_operations": [
        {
          "path": "frontend/src/config/polling.ts",
          "operation": "modify",
          "description": "Define polling/streaming configuration (poll interval, max payload strategy, throttle window, exponential backoff bounds, jitter) for the real-time telemetry service."
        },
        {
          "path": "frontend/src/services/realTimeEnergyService.ts",
          "operation": "create",
          "description": "Create a TypeScript real-time client that (1) attempts SSE/WS connection to the configured live stream URL when available, (2) falls back to incremental polling using authenticated calls, (3) manages connect/disconnect lifecycle, auto-reconnect with exponential backoff, cursor-based recovery using last-seen timestamp, and (4) throttles/batches emissions to subscribers. Use the authorization component’s token storage model (auth_token in localStorage) to attach auth without exposing the token in logs. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/services/liveReadingsApi.ts",
          "operation": "create",
          "description": "Add a small API wrapper that fetches latest readings and incremental readings since a timestamp/cursor, attaching Authorization from localStorage(\"auth_token\"). Prefer calling the existing canister actor methods when available; keep this wrapper focused on frontend wiring and graceful error mapping (unauthorized/network/parse)."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Add shared live-telemetry React context + hooks for latest readings, rolling averages, connection status, and freshness timestamps; integrate into authenticated routes.",
      "acceptanceCriteria": [
        "Components can subscribe to live readings via a hook without prop-drilling.",
        "Connection status is available globally to energy module pages and updates immediately on connect/disconnect.",
        "Rolling averages are computed client-side from the recent reading window and exposed in the same hook/context.",
        "Each metric group includes a last-updated timestamp that the UI can render."
      ],
      "file_operations": [
        {
          "path": "frontend/src/types/liveTelemetry.ts",
          "operation": "create",
          "description": "Define TypeScript types for canonical live readings, per-metric freshness timestamps, rolling window samples, rolling averages, and connection status (LIVE/DISCONNECTED), compatible with the backend’s reading shape."
        },
        {
          "path": "frontend/src/context/LiveTelemetryContext.tsx",
          "operation": "create",
          "description": "Implement LiveTelemetryProvider that subscribes to the real-time service, stores latest readings, maintains a short rolling window for averages, exposes connection status and freshness timestamps, and cleans up on unmount/logout. Use the authorization component’s session/token model (auth_token in localStorage) for authenticated access. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useLiveTelemetry.ts",
          "operation": "create",
          "description": "Create a hook that returns live telemetry state and derived values (latest per metric, rolling averages, status, freshness timestamps) from LiveTelemetryContext."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wire LiveTelemetryProvider into the authenticated area (under ProtectedRoute/AppLayout) so existing authenticated energy routes can access live telemetry without adding new routes."
        }
      ]
    },
    {
      "id": "REQ-6",
      "summary": "Update /consumption, /solar-analysis, and /cost-estimation to show live-updating values, LIVE/DISCONNECTED status badges, and last-updated timestamps with smooth value transitions while preserving existing manual fetch flows.",
      "acceptanceCriteria": [
        "Each of the three pages shows a LIVE/DISCONNECTED badge and a “Last updated” timestamp.",
        "When live data is available, headline metrics update automatically without requiring the user to click “Fetch Data”.",
        "Transitions for changing numeric values are visually smooth (no abrupt jumps), and stale data is visually indicated when disconnected.",
        "Existing manual “Fetch Data” behavior still works as a fallback and does not conflict with live updates."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/energy/LiveStatusBadge.tsx",
          "operation": "create",
          "description": "Add a lightweight energy-module component that renders LIVE/DISCONNECTED status and a freshness/staleness visual state (no changes to frontend/src/components/ui)."
        },
        {
          "path": "frontend/src/components/energy/LastUpdatedLabel.tsx",
          "operation": "create",
          "description": "Create a small component to render an English “Last updated” timestamp (and optionally “Stale” when disconnected), consuming values from the live telemetry hook."
        },
        {
          "path": "frontend/src/components/energy/AnimatedNumber.tsx",
          "operation": "create",
          "description": "Create a small presentational component to animate numeric value changes smoothly (e.g., interpolated count-up over a short duration) to avoid abrupt jumps."
        },
        {
          "path": "frontend/src/pages/energy/ConsumptionPage.tsx",
          "operation": "modify",
          "description": "Integrate useLiveTelemetry to show LIVE/DISCONNECTED badge and last-updated timestamp, and to auto-update headline metrics when live readings are available. Keep the existing Fetch Data button and state handling as a fallback, ensuring manual fetch does not break live updates."
        },
        {
          "path": "frontend/src/pages/energy/SolarAnalysisPage.tsx",
          "operation": "modify",
          "description": "Integrate useLiveTelemetry to display status badge and freshness timestamps, and auto-refresh headline values when live readings are available. Preserve existing loading/error/empty/manual Fetch Data behavior."
        },
        {
          "path": "frontend/src/pages/energy/CostEstimationPage.tsx",
          "operation": "modify",
          "description": "Integrate useLiveTelemetry to display status badge and freshness timestamps, and smooth transitions for top-level numeric values using AnimatedNumber. Keep manual Fetch Data as a fallback."
        }
      ]
    },
    {
      "id": "REQ-7",
      "summary": "Add lightweight, configurable, non-sensitive structured logging for real-time telemetry health and errors.",
      "acceptanceCriteria": [
        "Real-time service emits structured, non-sensitive logs for connection lifecycle events.",
        "Errors include actionable reasons (e.g., unauthorized, network error, parse error) without printing tokens.",
        "Logs can be disabled or reduced in production builds via a simple configuration flag."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/realtimeLogging.ts",
          "operation": "create",
          "description": "Implement a small logger utility that emits structured events (connect/disconnect, retry counts, last message time, error reasons) and redacts sensitive data (never log JWTs, request headers, or user-identifying payloads). Support an on/off (or level) flag via environment/config."
        },
        {
          "path": "frontend/src/services/realTimeEnergyService.ts",
          "operation": "modify",
          "description": "Integrate the logging utility into the real-time service to record lifecycle events, retry attempts, last message times, and categorized error reasons (unauthorized/network/parse/unknown) while ensuring tokens are never logged. Use the authorization component’s token storage model (auth_token in localStorage) safely. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/config/polling.ts",
          "operation": "modify",
          "description": "Add a simple configuration flag (or log level) controlling real-time logging verbosity, suitable for reducing or disabling logs in production builds."
        }
      ]
    }
  ]
}